---
title: GenericZone
classe: Autodesk.Revit.DB.Analysis.GenericZone
namespace: Autodesk.Revit.DB.Analysis
eredita: Autodesk.Revit.DB.Element
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 4
---

# GenericZone

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Double LevelOffset { get; set; }` | `genericZone.LevelOffset` | Double |
| `GenericZone Create(Document, String, GenericZoneDomainData, ElementId, IList<CurveLoop>)` | `GenericZone.Create(doc, name, domainData, levelId, curveLoops)` | GenericZone |
| `IList<CurveLoop> GetBoundaries()` | `genericZone.GetBoundaries()` | IList<CurveLoop> |
| `GenericZoneDomainData GetDomainData()` | `genericZone.GetDomainData()` | GenericZoneDomainData |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```